app/controllers/posts_controller.rb

SELECT  1 AS one FROM "authors" LIMIT 1
SELECT "authors".* FROM "authors"
---
  def new
    # @post = Post.new
    if params[:author_id] && !Author.exists?(params[:author_id])

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 123456]]
SELECT  "posts".* FROM "posts" WHERE "posts"."author_id" = ? AND "posts"."id" = ? LIMIT 1  [["author_id", 1], ["id", 1]]
---
  def edit
    #@post = Post.find(params[:id])
    if params[:author_id]
      author = Author.find_by(id: params[:author_id])
      if author.nil?
        redirect_to authors_path, alert: "Author not found."
      else
        @post = author.posts.find_by(id: params[:id])